def area(a):
    """ 
    Вычисляет площадь квадрата по заданной длине стороны.
    
        Параметры:
        a (float): Длина стороны квадрата.
    
    Возвращает:
        float: Площадь квадрата.
    
    Примеры:
        area(3) // 9
    """ 
    return a * a

def perimeter(a):
    """ 
    Вычисляет периметр квадрата по заданной длине стороны.
    
        Параметры:
        a (float): Длина стороны квадрата.
    
    Возвращает:
        float: Периметр квадрата.
    
    Примеры:
        perimeter(3) // 12
    """ 
    return 4 * a